project/load_gen/k6_run.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: put_only.js
        output: -

     scenarios: (100.00%) 1 scenario, 1500 max VUs, 1m10s max duration (incl. graceful stop):
              * default: 1500 looping VUs for 40s (gracefulStop: 30s)


running (0m00.9s), 1500/1500 VUs, 1723 complete and 0 interrupted iterations
default   [   2% ] 1500 VUs  00.9s/40s

running (0m01.9s), 1500/1500 VUs, 4828 complete and 0 interrupted iterations
default   [   5% ] 1500 VUs  01.9s/40s

running (0m02.9s), 1500/1500 VUs, 8066 complete and 0 interrupted iterations
default   [   7% ] 1500 VUs  02.9s/40s

running (0m03.9s), 1500/1500 VUs, 11103 complete and 0 interrupted iterations
default   [  10% ] 1500 VUs  03.9s/40s

running (0m04.9s), 1500/1500 VUs, 14097 complete and 0 interrupted iterations
default   [  12% ] 1500 VUs  04.9s/40s

running (0m05.9s), 1500/1500 VUs, 17144 complete and 0 interrupted iterations
default   [  15% ] 1500 VUs  05.9s/40s

running (0m06.9s), 1500/1500 VUs, 20117 complete and 0 interrupted iterations
default   [  17% ] 1500 VUs  06.9s/40s

running (0m07.9s), 1500/1500 VUs, 23208 complete and 0 interrupted iterations
default   [  20% ] 1500 VUs  07.9s/40s

running (0m08.9s), 1500/1500 VUs, 26208 complete and 0 interrupted iterations
default   [  22% ] 1500 VUs  08.9s/40s

running (0m09.9s), 1500/1500 VUs, 29848 complete and 0 interrupted iterations
default   [  25% ] 1500 VUs  09.9s/40s

running (0m10.9s), 1500/1500 VUs, 33284 complete and 0 interrupted iterations
default   [  27% ] 1500 VUs  10.9s/40s

running (0m11.9s), 1500/1500 VUs, 36218 complete and 0 interrupted iterations
default   [  30% ] 1500 VUs  11.9s/40s

running (0m12.9s), 1500/1500 VUs, 39346 complete and 0 interrupted iterations
default   [  32% ] 1500 VUs  12.9s/40s

running (0m13.9s), 1500/1500 VUs, 42583 complete and 0 interrupted iterations
default   [  35% ] 1500 VUs  13.9s/40s

running (0m14.9s), 1500/1500 VUs, 45615 complete and 0 interrupted iterations
default   [  37% ] 1500 VUs  14.9s/40s

running (0m15.9s), 1500/1500 VUs, 49210 complete and 0 interrupted iterations
default   [  40% ] 1500 VUs  15.9s/40s

running (0m16.9s), 1500/1500 VUs, 52553 complete and 0 interrupted iterations
default   [  42% ] 1500 VUs  16.9s/40s

running (0m17.9s), 1500/1500 VUs, 55719 complete and 0 interrupted iterations
default   [  45% ] 1500 VUs  17.9s/40s

running (0m18.9s), 1500/1500 VUs, 59538 complete and 0 interrupted iterations
default   [  47% ] 1500 VUs  18.9s/40s

running (0m19.9s), 1500/1500 VUs, 62504 complete and 0 interrupted iterations
default   [  50% ] 1500 VUs  19.9s/40s

running (0m20.9s), 1500/1500 VUs, 65734 complete and 0 interrupted iterations
default   [  52% ] 1500 VUs  20.9s/40s

running (0m21.9s), 1500/1500 VUs, 69125 complete and 0 interrupted iterations
default   [  55% ] 1500 VUs  21.9s/40s

running (0m22.9s), 1500/1500 VUs, 72502 complete and 0 interrupted iterations
default   [  57% ] 1500 VUs  22.9s/40s

running (0m23.9s), 1500/1500 VUs, 75375 complete and 0 interrupted iterations
default   [  60% ] 1500 VUs  23.9s/40s

running (0m24.9s), 1500/1500 VUs, 78764 complete and 0 interrupted iterations
default   [  62% ] 1500 VUs  24.9s/40s

running (0m25.9s), 1500/1500 VUs, 82559 complete and 0 interrupted iterations
default   [  65% ] 1500 VUs  25.9s/40s

running (0m26.9s), 1500/1500 VUs, 85553 complete and 0 interrupted iterations
default   [  67% ] 1500 VUs  26.9s/40s

running (0m27.9s), 1500/1500 VUs, 88576 complete and 0 interrupted iterations
default   [  70% ] 1500 VUs  27.9s/40s

running (0m28.9s), 1500/1500 VUs, 92430 complete and 0 interrupted iterations
default   [  72% ] 1500 VUs  28.9s/40s

running (0m29.9s), 1500/1500 VUs, 95596 complete and 0 interrupted iterations
default   [  75% ] 1500 VUs  29.9s/40s

running (0m30.9s), 1500/1500 VUs, 98687 complete and 0 interrupted iterations
default   [  77% ] 1500 VUs  30.9s/40s

running (0m31.9s), 1500/1500 VUs, 102320 complete and 0 interrupted iterations
default   [  80% ] 1500 VUs  31.9s/40s

running (0m32.9s), 1500/1500 VUs, 105587 complete and 0 interrupted iterations
default   [  82% ] 1500 VUs  32.9s/40s

running (0m33.9s), 1500/1500 VUs, 108689 complete and 0 interrupted iterations
default   [  85% ] 1500 VUs  33.9s/40s

running (0m34.9s), 1500/1500 VUs, 111697 complete and 0 interrupted iterations
default   [  87% ] 1500 VUs  34.9s/40s

running (0m35.9s), 1500/1500 VUs, 114776 complete and 0 interrupted iterations
default   [  90% ] 1500 VUs  35.9s/40s

running (0m36.9s), 1500/1500 VUs, 118577 complete and 0 interrupted iterations
default   [  92% ] 1500 VUs  36.9s/40s

running (0m37.9s), 1500/1500 VUs, 121258 complete and 0 interrupted iterations
default   [  95% ] 1500 VUs  37.9s/40s

running (0m38.9s), 1500/1500 VUs, 124600 complete and 0 interrupted iterations
default   [  97% ] 1500 VUs  38.9s/40s

running (0m39.9s), 1500/1500 VUs, 128367 complete and 0 interrupted iterations
default   [ 100% ] 1500 VUs  39.9s/40s

running (0m40.9s), 0500/1500 VUs, 129624 complete and 0 interrupted iterations
default ↓ [ 100% ] 1500 VUs  40s

running (0m41.9s), 0500/1500 VUs, 129624 complete and 0 interrupted iterations
default ↓ [ 100% ] 1500 VUs  40s

running (0m42.9s), 0500/1500 VUs, 129624 complete and 0 interrupted iterations
default ↓ [ 100% ] 1500 VUs  40s

running (0m43.9s), 0500/1500 VUs, 129624 complete and 0 interrupted iterations
default ↓ [ 100% ] 1500 VUs  40s

running (0m44.9s), 0500/1500 VUs, 129624 complete and 0 interrupted iterations
default ↓ [ 100% ] 1500 VUs  40s

running (0m45.9s), 0320/1500 VUs, 129804 complete and 0 interrupted iterations
default ↓ [ 100% ] 1500 VUs  40s

running (0m46.9s), 0312/1500 VUs, 129812 complete and 0 interrupted iterations
default ↓ [ 100% ] 1500 VUs  40s

running (0m47.9s), 0305/1500 VUs, 129819 complete and 0 interrupted iterations
default ↓ [ 100% ] 1500 VUs  40s

running (0m48.9s), 0305/1500 VUs, 129819 complete and 0 interrupted iterations
default ↓ [ 100% ] 1500 VUs  40s

running (0m49.9s), 0305/1500 VUs, 129819 complete and 0 interrupted iterations
default ↓ [ 100% ] 1500 VUs  40s

running (0m50.9s), 0305/1500 VUs, 129819 complete and 0 interrupted iterations
default ↓ [ 100% ] 1500 VUs  40s

running (0m51.9s), 0305/1500 VUs, 129819 complete and 0 interrupted iterations
default ↓ [ 100% ] 1500 VUs  40s

running (0m52.9s), 0305/1500 VUs, 129819 complete and 0 interrupted iterations
default ↓ [ 100% ] 1500 VUs  40s

running (0m53.9s), 0305/1500 VUs, 129819 complete and 0 interrupted iterations
default ↓ [ 100% ] 1500 VUs  40s

running (0m54.9s), 0305/1500 VUs, 129819 complete and 0 interrupted iterations
default ↓ [ 100% ] 1500 VUs  40s

running (0m55.9s), 0305/1500 VUs, 129819 complete and 0 interrupted iterations
default ↓ [ 100% ] 1500 VUs  40s

running (0m56.9s), 0305/1500 VUs, 129819 complete and 0 interrupted iterations
default ↓ [ 100% ] 1500 VUs  40s

running (0m57.9s), 0305/1500 VUs, 129819 complete and 0 interrupted iterations
default ↓ [ 100% ] 1500 VUs  40s

running (0m58.9s), 0305/1500 VUs, 129819 complete and 0 interrupted iterations
default ↓ [ 100% ] 1500 VUs  40s

running (0m59.9s), 0283/1500 VUs, 129841 complete and 0 interrupted iterations
default ↓ [ 100% ] 1500 VUs  40s
time="2025-11-25T05:31:33+05:30" level=warning msg="Request Failed" error="Post \"http://localhost:1234/save\": request timeout"
time="2025-11-25T05:31:33+05:30" level=warning msg="Request Failed" error="Post \"http://localhost:1234/save\": request timeout"
time="2025-11-25T05:31:33+05:30" level=warning msg="Request Failed" error="Post \"http://localhost:1234/save\": request timeout"
[...]

running (1m00.9s), 0143/1500 VUs, 129981 complete and 0 interrupted iterations
default ↓ [ 100% ] 1500 VUs  40s

running (1m01.9s), 0134/1500 VUs, 129990 complete and 0 interrupted iterations
default ↓ [ 100% ] 1500 VUs  40s

running (1m02.9s), 0134/1500 VUs, 129990 complete and 0 interrupted iterations
default ↓ [ 100% ] 1500 VUs  40s

running (1m03.9s), 0134/1500 VUs, 129990 complete and 0 interrupted iterations
default ↓ [ 100% ] 1500 VUs  40s

running (1m04.9s), 0134/1500 VUs, 129990 complete and 0 interrupted iterations
default ↓ [ 100% ] 1500 VUs  40s

running (1m05.9s), 0134/1500 VUs, 129990 complete and 0 interrupted iterations
default ↓ [ 100% ] 1500 VUs  40s

running (1m06.9s), 0134/1500 VUs, 129990 complete and 0 interrupted iterations
default ↓ [ 100% ] 1500 VUs  40s

running (1m07.9s), 0134/1500 VUs, 129990 complete and 0 interrupted iterations
default ↓ [ 100% ] 1500 VUs  40s

running (1m08.9s), 0134/1500 VUs, 129990 complete and 0 interrupted iterations
default ↓ [ 100% ] 1500 VUs  40s

running (1m09.9s), 0134/1500 VUs, 129990 complete and 0 interrupted iterations
default ↓ [ 100% ] 1500 VUs  40s


  █ TOTAL RESULTS 

    HTTP
    http_req_duration..............: avg=472.7ms  min=12.44ms med=307.41ms max=58.99s p(90)=391.37ms p(95)=439.14ms
      { expected_response:true }...: avg=409.62ms min=12.44ms med=307.37ms max=58.19s p(90)=391.16ms p(95)=436.3ms 
    http_req_failed................: 0.10%  140 out of 129990
    http_reqs......................: 129990 1856.941823/s

    EXECUTION
    iteration_duration.............: avg=487.16ms min=24.91ms med=307.74ms max=1m0s   p(90)=395.2ms  p(95)=444.29ms
    iterations.....................: 129990 1856.941823/s
    vus............................: 134    min=134           max=1500
    vus_max........................: 1500   min=1500          max=1500

    NETWORK
    data_received..................: 16 MB  223 kB/s
    data_sent......................: 22 MB  317 kB/s



running (1m10.0s), 0000/1500 VUs, 129990 complete and 134 interrupted iterations
default ✓ [ 100% ] 1500 VUs  40s